#pragma once

// ---------------------------------------------------------
// Engine Includes
// ---------------------------------------------------------
#include <Object3D.h>

// =========================================================
// プレイヤークラス
// =========================================================
class Player
{
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// 初期化処理
	/// </summary>
	void Initialize();

	/// <summary>
	/// 更新処理
	/// </summary>
	void Update(float deltaTime);

	/// <summary>
	/// 描画処理
	/// </summary>
	void Draw();

	/// <summary>
	/// デバッグ表示
	/// </summary>
	void Debug();

private:
	// =========================================================
	// Internal Methods
	// =========================================================

	/// <summary>
	/// キーボード用入力取得
	/// </summary>
	/// <returns></returns>
	Cygnus::Float3 GetKeyInput();

	/// <summary>
	/// ゲームパッド用入力取得
	/// </summary>
	/// <returns></returns>
	Cygnus::Float3 GetPadInput();

private:
	// =========================================================
	// Constants
	// =========================================================

	const float kMoveSpeed = 20.0f;	// 移動速度

	// =========================================================
	// Member Variables
	// =========================================================

	std::unique_ptr<Cygnus::Object3D> object_;	// オブジェクト

	Cygnus::Float3 velocity_ = {0.0f, 0.0f, 0.0f};	// 速度ベクトル
};

