#pragma once

// ---------------------------------------------------------
// Engine Includes
// ---------------------------------------------------------
#include <MyMath.h>

// =========================================================
// 汎用ユーティリティクラス
// =========================================================
class Utility {
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// ワールド座標をスクリーン座標に変換します。
	/// </summary>
	/// <param name="worldPosition">ワールド座標</param>
	/// <returns>スクリーン座標</returns>
	static Cygnus::Float3 WorldToScreen(const Cygnus::Float3& worldPosition);

private:
	// =========================================================
	// Constants
	// =========================================================
	static constexpr float kBlink = 0.0001f; /* 微小な値 */
};