#pragma once

// Engine
#include <Object3D.h>

// =========================================================
// ゴールオブジェクトクラス
// =========================================================
class Goal
{
public:
	// =========================================================
	// Public Methods
	// =========================================================

	/// <summary>
	/// 初期化処理
	/// </summary>
	void Initialize();

	/// <summary>
	/// 更新処理
	/// </summary>
	void Update();

	/// <summary>
	/// 描画処理
	/// </summary>
	void Draw();

private:
	// =========================================================
	// Constants
	// =========================================================
	const float kCoordinateY = 3.0f;

	// =========================================================
	// Member Variables
	// =========================================================
	std::unique_ptr<Cygnus::Object3D> object_;	// オブジェクト
};

